### Load data

In [18]:
load('./L2-data/2-DataPrep.RData')

### Display data

In [23]:
storms

  storm   wind pressure date
1 Alberto 110  1007     2000-08-03
2 Alex     45  1009     1998-07-27
3 Allison  65  1005     1995-06-03
4 Ana      40  1013     1997-06-30
5 Arlene   50  1010     1999-06-11
6 Arthur   45  1010     1996-06-17

In [24]:
cases

  country 2011  2012  2013
1 FR       7000  6900  7000
2 DE       5800  6000  6200
3 US      15000 14000 13000

In [25]:
pollution

  city     size  amount
1 New York large  23
2 New York small  14
3 London   large  22
4 London   small  16
5 Beijing  large 121
6 Beijing  small  56

In [27]:
head(tb) # display a few of top rows for large dataset

  country     year sex    child adult elderly
1 Afghanistan 1995 female NA    NA    NA
2 Afghanistan 1995 male   NA    NA    NA
3 Afghanistan 1996 female NA    NA    NA
4 Afghanistan 1996 male   NA    NA    NA
5 Afghanistan 1997 female  5    96     1
6 Afghanistan 1997 male    0    26     0

### Install packages
- download packages useful for data preparation

In [50]:
packages <- c('tidyr', 'dplyr')
install.packages(packages)
library(tidyr)
library(dplyr)

The downloaded binary packages are in
	/var/folders/71/32h8kjzx1d957cbl0_xhpyvr0000gn/T//RtmpQCNdBJ/downloaded_packages

Attaching package: ‘dplyr’


The following object is masked _by_ ‘.GlobalEnv’:

    storms


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

### Data Preparation Tasks

### Reshaping table

In [30]:
gather(cases, 'year', 'n', 2:4) # melt column 2,3,4

  country year n
1 FR      2011  7000
2 DE      2011  5800
3 US      2011 15000
4 FR      2012  6900
5 DE      2012  6000
6 US      2012 14000
7 FR      2013  7000
8 DE      2013  6200
9 US      2013 13000

In [32]:
spread(pollution, size, amount) # pivot table

  city     large small
1 Beijing  121   56
2 London    22   16
3 New York  23   14

### Reshaping column

In [34]:
storms2 <- separate(storms, date, c('year', 'month', 'date'), sep='-') # split date string
storms2

  storm   wind pressure year month date
1 Alberto 110  1007     2000 08    03
2 Alex     45  1009     1998 07    27
3 Allison  65  1005     1995 06    03
4 Ana      40  1013     1997 06    30
5 Arlene   50  1010     1999 06    11
6 Arthur   45  1010     1996 06    17

In [35]:
unite(storms2, "date", date, month, year, sep="-") # combine date parts

  storm   wind pressure date
1 Alberto 110  1007     03-08-2000
2 Alex     45  1009     27-07-1998
3 Allison  65  1005     03-06-1995
4 Ana      40  1013     30-06-1997
5 Arlene   50  1010     11-06-1999
6 Arthur   45  1010     17-06-1996

### Subsetting columns

In [52]:
select(storms, storm, pressure, date) # select columns

  storm   pressure date
1 Alberto 1007     2000-08-03
2 Alex    1009     1998-07-27
3 Allison 1005     1995-06-03
4 Ana     1013     1997-06-30
5 Arlene  1010     1999-06-11
6 Arthur  1010     1996-06-17

In [53]:
select(storms, -wind) # select all columns but wind

  storm   pressure date
1 Alberto 1007     2000-08-03
2 Alex    1009     1998-07-27
3 Allison 1005     1995-06-03
4 Ana     1013     1997-06-30
5 Arlene  1010     1999-06-11
6 Arthur  1010     1996-06-17

In [54]:
select(storms, 1:3) # select column 1, 2, 3

  storm   wind pressure
1 Alberto 110  1007
2 Alex     45  1009
3 Allison  65  1005
4 Ana      40  1013
5 Arlene   50  1010
6 Arthur   45  1010

In [56]:
select(storms, storm:pressure) # select column storm, pressure and all in between

  storm   wind pressure
1 Alberto 110  1007
2 Alex     45  1009
3 Allison  65  1005
4 Ana      40  1013
5 Arlene   50  1010
6 Arthur   45  1010

In [57]:
select(storms, ends_with('e')) # select column whose name end with e

  pressure date
1 1007     2000-08-03
2 1009     1998-07-27
3 1005     1995-06-03
4 1013     1997-06-30
5 1010     1999-06-11
6 1010     1996-06-17

### Subsetting rows

In [60]:
filter(storms, wind >= 50)

  storm   wind pressure date
1 Alberto 110  1007     2000-08-03
2 Allison  65  1005     1995-06-03
3 Arlene   50  1010     1999-06-11

In [63]:
filter(storms, wind >= 50, storm %in% c('Arlene', 'Allison')) # multiple conditions joined by and

  storm   wind pressure date
1 Allison 65   1005     1995-06-03
2 Arlene  50   1010     1999-06-11

### Make new variables

In [64]:
mutate(storms, ratio=pressure / wind, inverse=ratio ^ -1)

  storm   wind pressure date       ratio     inverse
1 Alberto 110  1007     2000-08-03  9.154545 0.10923535
2 Alex     45  1009     1998-07-27 22.422222 0.04459861
3 Allison  65  1005     1995-06-03 15.461538 0.06467662
4 Ana      40  1013     1997-06-30 25.325000 0.03948667
5 Arlene   50  1010     1999-06-11 20.200000 0.04950495
6 Arthur   45  1010     1996-06-17 22.444444 0.04455446

In [68]:
# find cumulative minimum of pressure and element-wise maximum between pressure and the cummulative minimum
mutate(storms, cum_min=cummin(pressure), p_max=pmax(pressure, cum_min))

  storm   wind pressure date       cum_min p_max
1 Alberto 110  1007     2000-08-03 1007    1007
2 Alex     45  1009     1998-07-27 1007    1009
3 Allison  65  1005     1995-06-03 1005    1005
4 Ana      40  1013     1997-06-30 1005    1013
5 Arlene   50  1010     1999-06-11 1005    1010
6 Arthur   45  1010     1996-06-17 1005    1010

In [75]:
mutate(storms, tile=ntile(pressure, n=4)) # group presssure into equally sized groups

  storm   wind pressure date       tile
1 Alberto 110  1007     2000-08-03 1
2 Alex     45  1009     1998-07-27 2
3 Allison  65  1005     1995-06-03 1
4 Ana      40  1013     1997-06-30 4
5 Arlene   50  1010     1999-06-11 2
6 Arthur   45  1010     1996-06-17 3

In [76]:
mutate(storms, lag_p=lag(pressure)) # create new pressure column shifted down one row

  storm   wind pressure date       lag_p
1 Alberto 110  1007     2000-08-03   NA
2 Alex     45  1009     1998-07-27 1007
3 Allison  65  1005     1995-06-03 1009
4 Ana      40  1013     1997-06-30 1005
5 Arlene   50  1010     1999-06-11 1013
6 Arthur   45  1010     1996-06-17 1010

In [78]:
# create new flag column giving TRUE for pressure between 1000 and 1010
mutate(storms, is_between=between(pressure, 1000, 1010))

  storm   wind pressure date       is_between
1 Alberto 110  1007     2000-08-03  TRUE
2 Alex     45  1009     1998-07-27  TRUE
3 Allison  65  1005     1995-06-03  TRUE
4 Ana      40  1013     1997-06-30 FALSE
5 Arlene   50  1010     1999-06-11  TRUE
6 Arthur   45  1010     1996-06-17  TRUE

In [79]:
# create new column denoting proportion of rows with pressure value not exceeding current row pressure
mutate(storms, cum_d=cume_dist(pressure))

  storm   wind pressure date       cum_d
1 Alberto 110  1007     2000-08-03 0.3333333
2 Alex     45  1009     1998-07-27 0.5000000
3 Allison  65  1005     1995-06-03 0.1666667
4 Ana      40  1013     1997-06-30 1.0000000
5 Arlene   50  1010     1999-06-11 0.8333333
6 Arthur   45  1010     1996-06-17 0.8333333

### Summarise data

In [96]:
# compute mean, variace, no. of observation of all time cases 
cases %>% gather('year', 'n', 2:4) %>% summarise(mean=mean(n), variance=var(n), n=n())

  mean     variance n
1 8988.889 14561111 9

### Sort data

In [97]:
arrange(pollution, desc(amount)) # sort data by pollution amount descendingly

  city     size  amount
1 Beijing  large 121
2 Beijing  small  56
3 New York large  23
4 London   large  22
5 London   small  16
6 New York small  14

### Group data

In [99]:
# group data by city then compute group mean and maximum polution
agg_poll <- pollution %>% group_by(city) %>% summarise(mean=mean(amount), max=max(amount))
agg_poll

  city     mean max
1 Beijing  88.5 121
2 London   19.0  22
3 New York 18.5  23

### Join

In [104]:
# sort data by pollution amount then left join with aggregated pollution data
pollution %>% arrange(amount) %>% left_join(agg_poll, by='city')

  city     size  amount mean max
1 New York small  14    18.5  23
2 London   small  16    19.0  22
3 London   large  22    19.0  22
4 New York large  23    18.5  23
5 Beijing  small  56    88.5 121
6 Beijing  large 121    88.5 121